app/controllers/cafedrink_controller.rb

  def index
    @cafedrinks = Cafedrink.includes(:user).order("created_at DESC").page(params[:page]).per(5)
---
SELECT  `cafedrinks`.* FROM `cafedrinks` ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `cafedrinks`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)

  def create
    Cafedrink.create(name: cafedrink_params[:name], price: cafedrink_params[:price], place: cafedrink_params[:place], image: cafedrink_params[:image], memo: cafedrink_params[:memo], user_id: current_user.id)
---
INSERT INTO `cafedrinks` (`name`, `price`, `image`, `memo`, `created_at`, `updated_at`, `place`, `user_id`) VALUES ('キャラメルマキアート', '550', 'https://www.starbucks.co.jp/assets/images/press_release/images/2011/exc-bitter-caramel-frappuccino.jpg', '美味しい', '2019-03-05 16:13:15', '2019-03-05 16:13:15', 'スタバ', 1)

  def destroy
    cafedrink = Cafedrink.find(params[:id])
    cafedrink.destroy if cafedrink.user_id == current_user.id
---
SELECT  `cafedrinks`.* FROM `cafedrinks` WHERE `cafedrinks`.`id` = 6 LIMIT 1
DELETE FROM `cafedrinks` WHERE `cafedrinks`.`id` = 6

  def edit
    @cafedrink = Cafedrink.find(params[:id])
---
SELECT  `cafedrinks`.* FROM `cafedrinks` WHERE `cafedrinks`.`id` = 14 LIMIT 1

  def update
    cafedrink = Cafedrink.find(params[:id])
    if cafedrink.user_id == current_user.id
        cafedrink.update(cafedrink_params)
---
SELECT  `cafedrinks`.* FROM `cafedrinks` WHERE `cafedrinks`.`id` = 14 LIMIT 1
UPDATE `cafedrinks` SET `name` = 'キャラメルホイップ', `star` = '', `updated_at` = '2019-03-06 11:33:45' WHERE `cafedrinks`.`id` = 14

  def show
    @cafedrink = Cafedrink.find(params[:id])
---
SELECT  `cafedrinks`.* FROM `cafedrinks` WHERE `cafedrinks`.`id` = 6 LIMIT 1