app/controllers/users_controller.rb

  def show
    user = User.find(params[:id])
    @nickname= current_user.nickname
    @cafedrinks = user.cafedrinks.page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `cafedrinks`.* FROM `cafedrinks` WHERE `cafedrinks`.`user_id` = 1 ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `cafedrinks` WHERE `cafedrinks`.`user_id` = 1